Revit 2027 API
LightDimmingColor Enumeration
 Tags for specific light dimming colors
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LightDimmingColor
Public Enumeration LightDimmingColor
public enum class LightDimmingColor
type LightDimmingColor
Members
Member name | Value | Description
Incandescent | 1 |  Incandescent lamp curve dimming color.
None | 0 |  No dimming color.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace